_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_БыстрыйВводОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>УСОERP_БыстрыйВводОбъектовНедвижимости</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектНедвижимостиРодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоляОбъект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКвартиры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подъезд</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этаж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяПлощадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЖилаяПлощадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЖилыхКомнат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРегистрацииПараметровОбъектаНедвижимости</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УПН_РегистрацияПараметровОбъектовНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модифицирован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаЕдиницуИзмерения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УПН_ВидыОперацийРегистрацияПараметровОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УПН_ВидыОперацийРегистрацияПараметровОбъектовНедвижимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИзменениеПлощадей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническаяИнвентаризация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УПН_ТипыОперацийСНедвижимостью.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УПН_ТипыОперацийСНедвижимостью</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УПН_РегистрацияПараметровОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УПН_РегистрацияПараметровОбъектовНедвижимости</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УПН_ПараметрыОбъектовНедвижимостиПоБТИ</xr:Item>
				<xr:Item>InformationRegister.УПН_ПлощадиОбъектовНедвижимости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_ВидыОперацийРегистрацияПараметровОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТехПаспортаБТИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТехПаспортаБТИ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновитьИнформациюОФактическихПлощадяхОбъектов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыОбъектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяПлощадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЖилаяПлощадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЖилыхКомнат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УПН_РегистрацияЦенОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УПН_РегистрацияЦенОбъектовНедвижимости</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УПН_ЦеныОбъектовНедвижимости</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_ТипыОперацийСНедвижимостью</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦеныОбъектовНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаЕдиницуПлощади</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/АУН_ОбъектыНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>АУН_ОбъектыНедвижимости</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКвартиры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНедвижимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_ТипыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АУН_КатегорииОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подъезд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_НазначенияОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринадлежитОбъекту</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_БыстрыйВводОбъектовНедвижимости/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Функция ПолучитьМассивПолейШаблонаНаименования()
	МассивПолей = Новый Массив;
	МассивПолей.Добавить("НомерКвартиры");
	МассивПолей.Добавить("Подъезд");
	МассивПолей.Добавить("Этаж");
	МассивПолей.Добавить("КоличествоЖилыхКомнат");
	Возврат МассивПолей;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КопироватьДанныеФормы(ЭтаФорма.Параметры, ЭтаФорма.Объект);
	
	Если Параметры.Свойство("ОбъектЭксплуатации")  Тогда
		Объект.ОбъектЭксплуатации = Параметры.ОбъектЭксплуатации;
	КонецЕсли;
	
	Если Параметры.Свойство("ОбъектНедвижимостиРодитель") Тогда
		Объект.ОбъектНедвижимостиРодитель = Параметры.ОбъектНедвижимостиРодитель;
		ПринадлежитОбъекту = Объект.ОбъектНедвижимостиРодитель;
	КонецЕсли;
	
	Объект.ШаблонНаименования = Объект.ОбъектНедвижимостиРодитель.ШаблонНаименования;
	Элементы.ОбъектЭксплуатации.ТолькоПросмотр = ЗначениеЗаполнено(Объект.ОбъектЭксплуатации);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКонструкторШаблонаНаименования(Команда)
	
	//ФормаРедактированияШаблона = ПолучитьФорму("Обработка.УСОERP_БыстрыйВводОбъектовНедвижимости.Форма.ФормаРедактированияШаблонаНаименования",Новый Структура ("ШаблонНаименования,ОбъектНедвижимостиРодитель",Объект.ШаблонНаименования,Объект.ОбъектНедвижимостиРодитель),ЭтаФорма);
	//ФормаРедактированияШаблона.Открыть();
	
	ОткрытьФорму("Обработка.УСОERP_БыстрыйВводОбъектовНедвижимости.Форма.ФормаРедактированияШаблонаНаименования", Новый Структура("ШаблонНаименования,ОбъектНедвижимостиРодитель", Объект.ШаблонНаименования, Объект.ОбъектНедвижимостиРодитель), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Объект.ШаблонНаименования = ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименованиеПоШаблону(ТекущиеДанные)
	ТекущиеДанные.Доля = Объект.ШаблонНаименования;
	МассивПолей = ПолучитьМассивПолейШаблонаНаименования();
	Для Каждого Поле Из МассивПолей Цикл
		ТекущиеДанные.Доля = СтрЗаменить(ТекущиеДанные.Доля,"["+Поле+"]",ТекущиеДанные[Поле]);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДолиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Элемент.ТекущиеДанные.Модифицирован = Истина;
	Если НоваяСтрока Тогда
		ЗаполнитьЗначенияСвойств(Элемент.ТекущиеДанные,Объект.ОбъектНедвижимостиРодитель);
		СформироватьНаименованиеПоШаблону(Элемент.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДолиНомерПриИзменении(Элемент)
	СформироватьНаименованиеПоШаблону(Элементы.Доли.ТекущиеДанные)
КонецПроцедуры

&НаКлиенте
Процедура ДолиПодъездПриИзменении(Элемент)
	СформироватьНаименованиеПоШаблону(Элементы.Доли.ТекущиеДанные)
КонецПроцедуры

&НаКлиенте
Процедура ДолиКоличествоЖилыхКомнатПриИзменении(Элемент)
	СформироватьНаименованиеПоШаблону(Элементы.Доли.ТекущиеДанные)
КонецПроцедуры

&НаКлиенте
Процедура ДолиЭтажПриИзменении(Элемент)
	СформироватьНаименованиеПоШаблону(Элементы.Доли.ТекущиеДанные)
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОбъектыНедвижимостиНаСервере()
	ИзмененныеСтроки = Объект.Доли.НайтиСтроки(Новый Структура("Модифицирован",Истина));
	Для Каждого ИзмененнаяСтрока Из ИзмененныеСтроки Цикл
		//запись нового или модификация уже записанного объекта недвижимости
		Если ЗначениеЗаполнено(ИзмененнаяСтрока.ДоляОбъект) Тогда
			ОбъектНедвижимости = ИзмененнаяСтрока.ДоляОбъект.ПолучитьОбъект();
		Иначе
			ОбъектНедвижимости = Справочники.АУН_ОбъектыНедвижимости.СоздатьЭлемент();
		КонецЕсли;
		ОбъектНедвижимости.Наименование = ИзмененнаяСтрока.Доля;
		ЗаполнитьЗначенияСвойств(ОбъектНедвижимости,Объект);
		ЗаполнитьЗначенияСвойств(ОбъектНедвижимости,ИзмененнаяСтрока);
		ОбъектНедвижимости.Родитель = Объект.ОбъектНедвижимостиРодитель;
		ОбъектНедвижимости.КатегорияОбъекта = КатегорияОбъекта;
		ОбъектНедвижимости.ТипНедвижимости = ТипНедвижимости;
		ОбъектНедвижимости.ПринадлежитОбъекту = ПринадлежитОбъекту;
		ОбъектНедвижимости.Записать();
		ИзмененнаяСтрока.ДоляОбъект = ОбъектНедвижимости.Ссылка;
		
		//запись нового или модификация существующего документа регистрации параметров
		Если ИзмененнаяСтрока.ОбщаяПлощадь+ИзмененнаяСтрока.ЖилаяПлощадь+ИзмененнаяСтрока.КоличествоЖилыхКомнат>0 ИЛИ ЗначениеЗаполнено(ИзмененнаяСтрока.ДокументРегистрацииПараметровОбъектаНедвижимости) Тогда
			Если ЗначениеЗаполнено(ИзмененнаяСтрока.ДокументРегистрацииПараметровОбъектаНедвижимости) Тогда
				ДокументРегистрацияПараметров = ИзмененнаяСтрока.ДокументРегистрацииПараметровОбъектаНедвижимости.ПолучитьОбъект();
			Иначе
				ДокументРегистрацияПараметров = Документы.УПН_РегистрацияПараметровОбъектовНедвижимости.СоздатьДокумент();
			КонецЕсли;
			
			ДокументРегистрацияПараметров.Организация = Объект.Организация;
			ДокументРегистрацияПараметров.ВидОперации = Перечисления.УПН_ВидыОперацийРегистрацияПараметровОбъектовНедвижимости.ИзменениеПлощадей;
			ДокументРегистрацияПараметров.Дата = ТекущаяДата();
			ДокументРегистрацияПараметров.Заполнить(Неопределено);
			
			ДокументРегистрацияПараметров.ПараметрыОбъектов.Очистить();
			НоваяСтрока = ДокументРегистрацияПараметров.ПараметрыОбъектов.Добавить();
			НоваяСтрока.ОбъектНедвижимости = ИзмененнаяСтрока.ДоляОбъект;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ИзмененнаяСтрока);
			
			ДокументРегистрацияПараметров.Записать(РежимЗаписиДокумента.Запись);
			
			Попытка
				ДокументРегистрацияПараметров.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			Исключение
			КонецПопытки;
		КонецЕсли;
		ИзмененнаяСтрока.ДокументРегистрацииПараметровОбъектаНедвижимости = ДокументРегистрацияПараметров.Ссылка;
		
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Создан документ %1'"), ДокументРегистрацияПараметров.Ссылка));
		
		ИзмененнаяСтрока.Модифицирован = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОбъектыНедвижимости(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	ЗаписатьОбъектыНедвижимостиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументЦеныНаОбъектНедвижимостиНаСервере(ДанныеФормы)
	
	ДокументРегистрацияЦен = Документы.УПН_РегистрацияЦенОбъектовНедвижимости.СоздатьДокумент();
	ДокументРегистрацияЦен.ТипОперации 	= Перечисления.УПН_ТипыОперацийСНедвижимостью.Продажа;
	ДокументРегистрацияЦен.Дата 		= ТекущаяДата();
	ДокументРегистрацияЦен.Заполнить(Неопределено);
	
	Для Каждого ТекСтрока Из Объект.Доли Цикл
		НоваяСтрока = ДокументРегистрацияЦен.ЦеныОбъектовНедвижимости.Добавить();
		НоваяСтрока.ОбъектНедвижимости 		= ТекСтрока.ДоляОбъект;
		НоваяСтрока.ЦенаЗаЕдиницуПлощади 	= ТекСтрока.ЦенаЗаЕдиницуИзмерения;
		НоваяСтрока.Стоимость 				= ТекСтрока.ЦенаЗаЕдиницуИзмерения * ТекСтрока.ОбщаяПлощадь;
	КонецЦикла;
	
	ЗначениеВДанныеФормы(ДокументРегистрацияЦен, ДанныеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЦеныНаОбъектНедвижимости(Команда)
	
	Если Объект.Доли.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ТекСтрокаТЧ Из Объект.Доли Цикл
		Если Не ЗначениеЗаполнено(ТекСтрокаТЧ.ДоляОбъект) Тогда
			ПоказатьПредупреждение(,"Для регистрации цен новые объекты необходимо сначала записать!");
			Возврат;
		КонецЕсли;
	КонецЦикла;
		
	Форма = ПолучитьФорму("Документ.УПН_РегистрацияЦенОбъектовНедвижимости.Форма.ФормаДокумента",, ЭтаФорма);
	ДанныеФормы = Форма.Объект;
	СоздатьДокументЦеныНаОбъектНедвижимостиНаСервере(ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыеСтрокиКопированием(Команда)
	ТекущийНомерПомещения = НомерКопирования;
	Для Каждого СтрокаКопирования  Из Элементы.Доли.ВыделенныеСтроки Цикл
		НоваяСтрока = Объект.Доли.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Объект.Доли[СтрокаКопирования]);
		НоваяСтрока.Модифицирован = Истина;
		НоваяСтрока.ДоляОбъект = Неопределено;
		НоваяСтрока.ДокументРегистрацииПараметровОбъектаНедвижимости = Неопределено;
		НоваяСтрока.Подъезд = ПодъездКопирования;
		НоваяСтрока.Этаж = ЭтажКопирования;
		НоваяСтрока.НомерКвартиры = ТекущийНомерПомещения;
		СформироватьНаименованиеПоШаблону(НоваяСтрока);
		ТекущийНомерПомещения = ТекущийНомерПомещения + 1;
	КонецЦикла;
КонецПроцедуры
